tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "github/gh"

cask_args appdir: "/Applications"

# Shell
brew "fish"

# Services
brew "dnsmasq"
brew "php"
brew "mysql"
brew "redis"
brew "nginx"

# Brews
brew "openssl"
brew "readline"
brew "zlib"
brew "httpie"
brew "pkg-config"
brew "git"
brew "github/gh/gh"
brew "vim"
brew "neovim"
brew "wget"
brew "mas"
brew "composer"
brew "sqlite"
brew "node"
brew "npm"
brew "python"
brew "ruby"
brew "tldr"
brew "starship"
brew "ghostscript"
brew "imagemagick"

# Casks
cask "1password"
cask "iterm2"
cask "alfred"
cask "karabiner-elements"
cask "bartender"
cask "phpstorm"
cask "github"
cask "notion"
cask "adguard"
cask "tunnelblick"
cask "sublime-text"
cask "postman"
cask "tableplus"
cask "drobo-dashboard"
cask "whatsapp"
cask "iina"
cask "slack"
cask "spotify"
cask "telegram"
cask "anydesk"
cask "jdownloader"

# Casks: eBooks
cask "calibre"
cask "kindle"
cask "kindle-previewer"
cask "adobe-digital-editions"
cask "send-to-kindle"
cask "kindlegen"
cask "sigil"

mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "iMovie", id: 408981434
mas "GarageBand", id: 682658836
mas "Swift Playgrounds", id: 1496833156
mas "TweetDeck", id: 485812721
mas "Audiobook Binder", id: 413969927
mas "Klib - Organize Highlights", id: 1196268448
mas "Be Focused Pro", id: 961632517
mas "Noizio", id: 928871589
mas "Moom", id: 419330170
mas "Network Radar", id: 507659816
mas "Blackmagic Disk Speed Test", id: 425264550

#Fonts

cask "font-fantasque-sans-mono"
cask "font-domine"
cask "font-jetbrains-mono"
cask "font-fira-mono-for-powerline"
cask "font-inter"